



[
    {
      "foodName": "Pizza",
      "foodImage": "https://i.ibb.co/4F6kbg2/menu-7.jpg",
      "foodCategory": "Pizza",
      "price": 10.99,
      "description": "Delicious pepperoni pizza with a blend of mozzarella and marinara sauce.",
      "details": "Pizza is a savory dish of Italian origin consisting of a usually round, flattened base of leavened wheat-based dough topped with tomatoes, cheese, and often various other ingredients (such as anchovies, mushrooms, onions, olives, pineapple, meat, etc.), which is then baked at a high temperature, traditionally in a wood-fired oven.Pizza has its origins in Naples, Italy, in the 18th century, and since then has spread throughout the world. Today, it is one of the most popular foods in the world, and is enjoyed by people of all ages and backgrounds.Pizza is typically made with a thin, crispy crust, but there are also variations with thicker, chewier crusts. The crust is usually topped with a layer of tomato sauce, followed by a layer of cheese. The most common type of cheese used on pizza is mozzarella, but other cheeses such as cheddar, Parmesan, and provolone are also popular.In addition to the basic tomato sauce and cheese toppings, there are many other popular pizza toppings, including:Meat: pepperoni, sausage, bacon, ham, ground beef, chickenVegetables: mushrooms, onions, olives, peppers, tomatoes, pineapple Other: anchovies, garlic, herbs, spicesPizza can be eaten hot or cold, and can be served as a main course or an appetizer. It is often accompanied by a side of dipping sauce, such as marinara sauce, ranch dressing, or blue cheese dressing.Here is a more detailed description of the different components of a pizza:Crust: The crust is the base of the pizza and is made with flour, water, yeast, and salt. It can be thin and crispy, or thick and chewy.Sauce: The sauce is typically made with tomatoes, garlic, and herbs. It can be spicy or mild, depending on your preference.Cheese: The cheese is the most important topping on a pizza and is responsible for the gooey, delicious flavor. The most common type of cheese used on pizza is mozzarella, but other cheeses such as cheddar, Parmesan, and provolone are also popular.Toppings: Toppings are the finishing touch on a pizza and can be anything you like. The most popular toppings include pepperoni, sausage, mushrooms, onions, olives, and peppers.Pizza is a versatile food that can be enjoyed by people of all ages and backgrounds. It is perfect for a quick snack, a family meal, or a party. Whether you like it with classic toppings or something more unique, there is a pizza out there for everyone.",
      "order": 9,
      "quantity":12

    },
    {
      "foodName": "Beef Burger",
      "foodImage": "https://i.ibb.co/Jd0DXbZ/burger.png",
      "foodCategory": "Burger",
      "price": 11.99,
      "description": "Classic beef burger with lettuce, tomato, and special sauce.",
      "details": "Beef burger is a popular dish that typically consists of a ground beef patty placed inside a sliced bun or bread roll. The origins of the beef burger can be traced back to Hamburg, Germany, in the 19th century, with German immigrants later introducing this culinary delight to the United States, where it rapidly gained popularity. In the late 19th century, burgers made their debut at street fairs and carnivals, and in the early 1900s, they started appearing on restaurant menus. Today, beef burgers are one of the most beloved foods worldwide, enjoyed at fast food joints, casual dining establishments, and even fine dining restaurants. Many people also relish the experience of making beef burgers at home. A classic beef burger patty is typically crafted from ground beef, seasoned with salt and pepper. While grilling is a common cooking method, you can also pan-fry or bake the patty. The level of doneness can vary from rare to well-done, catering to individual preferences. The buns used for beef burgers can be made from various types of bread, such as white bread, wheat bread, or brioche buns. These buns are usually toasted before assembling the burger to add a delightful crunch and warmth to the overall experience. Toppings for beef burgers are highly customizable and can be adjusted to suit personal taste. Some popular toppings include: 1. Cheese: Options like cheddar cheese, American cheese, Swiss cheese, and blue cheese are favored choices to add a rich and creamy dimension to your beef burger. 2. Lettuce: Varieties like iceberg lettuce, romaine lettuce, and butter lettuce provide a refreshing, crisp contrast to the savory patty. 3. Tomato: Sliced tomatoes are a classic topping that adds a juicy, acidic element to the burger. 4. Onion: Whether you prefer sliced onions, caramelized onions, or onion rings, they contribute various textures and flavors to the burger. 5. Pickles: Sliced pickles are a time-tested choice, imparting a tangy and slightly sweet note to the overall taste. 6. Ketchup: Ketchup, a classic condiment, brings a sweet and tangy flavor to complement the beef patty. 7. Mustard: Mustard is another classic condiment that adds a zesty, slightly spicy kick to the burger. 8. Mayonnaise: Mayonnaise provides a creamy and rich element that harmonizes with the other flavors in the burger. In summary, beef burgers have a rich history and are a beloved culinary creation enjoyed in various settings. The combination of a seasoned beef patty, a variety of bread options, and customizable toppings makes it a versatile and universally adored dish.",
      "order": 7,
      "quantity":12
    },
    {
      "foodName": "Dessert",
      "foodImage": "https://i.ibb.co/HHfSmhv/RFO-1400x919-classic-chocolate-mousse-69ef9c9c-5bfb-4750-80e1-31aafbd80821-0-1400x919.jpg",
      "foodCategory": "Dessert",
      "price": 5.99,
      "description": "Sweet and indulgent chocolate cake with a drizzle of caramel.",
      "details": "Desert food, with its rich and diverse culinary traditions, offers a unique and delightful gastronomic experience. Desert regions around the world have developed their own distinct cuisines, reflecting the cultural and environmental influences that have shaped their culinary heritage. In the Middle East, for example, you'll find dishes like falafel, shawarma, and hummus, which are cherished for their savory flavors and use of ingredients like chickpeas, tahini, and aromatic spices. These dishes are often served with warm, fluffy pita bread and fresh salads, creating a harmonious balance of flavors and textures. North African desert cuisine features tagines, couscous, and flavorful stews. Tagines are slow-cooked dishes that incorporate a variety of ingredients, such as tender meats, aromatic spices, and dried fruits, resulting in a symphony of sweet and savory tastes. Couscous, a staple, is often steamed to perfection and served as a bed for flavorful tagines. In the American Southwest, the desert landscape has influenced the cuisine with dishes like chili, enchiladas, and tacos. These foods embrace bold, spicy flavors and incorporate ingredients such as chili peppers, beans, and corn. Served with salsa, guacamole, and sour cream, they offer a balance of heat and cooling elements.",
      "order": 8,
      "quantity":4
    },
    {
      "foodName": "French Fries",
      "foodImage": "bhttps://i.ibb.co/MP5Hjj3/f5.png",
      "foodCategory": "Chips/Fries",
      "price": 6.99,
      "description": "Savory chicken burger served with crispy fries on the py French fries seasoned to perfection.",
      "details": "View Details",
      "order": 5
    },
    {
      "foodName": "chicken Pizza ",
      "foodImage": "https://i.ibb.co/WkW4WhN/f3.png",
      "foodCategory": "Pizza",
      "price": 3.99,
      "description": "Spicy buffalo chicken pizza with blue cheese dressing.",
      "details": "French fries, often referred to as simply are a beloved and ubiquitous side dish that has become a staple in the global culinary landscape. These slender, golden-brown delights consist of potato strips, typically cut into elongated shapes and deep-fried to perfection. The preparation of French fries begins with selecting the right type of potato, often russet or Idaho potatoes, prized for their starchy interiors and slightly thicker cut. The potatoes are peeled, cut into uniform sticks, and then soaked in cold water to remove excess starch. They are subsequently fried in hot oil until they acquire a crispy, golden exterior and a soft, fluffy interior. French fries are incredibly versatile and pair well with a variety of seasonings and condiments. They can be lightly salted for a classic and straightforward flavor or seasoned with herbs, spices, or even truffle oil for a gourmet twist. Common accompaniments include ketchup, mayonnaise, vinegar, aioli, or even a decadent cheese sauce for a more indulgent experience. These delectable treats are not only a beloved side dish but also a popular snack, often served at fast food establishments, diners, and restaurants of all kinds. They can also be enjoyed in various styles, from shoestring fries to thick-cut steak fries, or as curly fries with a unique spiral shape. French fries are celebrated for their delightful combination of crispy exteriors and tender interiors, making them an irresistible comfort food enjoyed by people of all ages. Whether served as a side to a burger, hot dog, or sandwich or as a standalone snack, the universal appeal of French fries continues to make them a classic and comforting treat.",
      "order": 12,
      "quantity":6
    },
    {
      "foodName": "Spicy Burger",
      "foodImage": "https://i.ibb.co/FJ16GGL/f2.png",
      "foodCategory": "Burger",
      "price": 4.99,
      "description": "Creamy cheesecake topped with fresh berries and a crumbly crust.",
      "details": "View Details",
      "order": 14
    },
    {
      "foodName": "cake",
      "foodImage": "https://i.ibb.co/g4YLd80/b4b73ab7da87ac4adef2934c4bcae41f.jpg",
      "foodCategory": "Dessert",
      "price": 2.99,
      "description": "Sweet and indulgent chocolate cake with a drizzle of caramel.",
      "details": "A spicy burger is a tantalizing and fiery twist on the classic beef burger. This bold and flavorful creation takes the beloved burger to a whole new level, delivering an explosion of heat and taste in every bite. At the heart of a spicy burger is a beef patty infused with a potent blend of spices and seasonings. The ground beef is generously seasoned with ingredients such as cayenne pepper, chili powder, paprika, and crushed red pepper flakes, resulting in a patty that packs a spicy punch. The spiciness can be adjusted to suit individual preferences, ranging from a subtle kick to a fiery inferno. To complement the heat, the toppings are carefully selected to enhance the flavor and balance the burger. Common choices include pepper jack cheese, jalapeño peppers, or even habanero aioli to further intensify the spiciness. These elements add layers of complexity to the burger, combining creaminess, heat, and a touch of smokiness. To offset the heat, crisp lettuce, cool tomato slices, and creamy avocado or guacamole are often included to provide a refreshing contrast. The buns, typically toasted, add a subtle sweetness and help mellow the overall experience. A spicy burger is not for the faint of heart, but for those who crave bold, intense flavors and the thrilling sensation of heat. It's a delightful departure from the traditional burger, making each bite an exciting journey for the taste buds. Whether enjoyed at a specialty burger joint or crafted at home, a spicy burger is sure to satisfy the cravings of spice aficionados and adventurous food lovers alike.",
      "order": 2,
      "quantity":14
    },
    {
      "foodName": "Chicken Fry",
      "foodImage": "https://i.ibb.co/ZGQGtRd/intro-1565810304.jpg",
      "foodCategory": "Chips/Fries",
      "price": 3.99,
      "description": "Savory chicken burger served with crispy fries on the py French fries seasoned to perfection.",
      "details": "Chicken fry is a mouthwatering and popular dish that features tender pieces of chicken seasoned with a delectable blend of spices and herbs before being fried to golden perfection. This culinary delight offers a delightful contrast of crispy, flavorful coating and succulent, juicy chicken on the inside. To prepare chicken fry, bone-in or boneless chicken pieces are typically marinated in a mixture of yogurt and an array of aromatic spices such as cumin, coriander, turmeric, chili powder, and garam masala. This marination infuses the meat with a burst of flavors and ensures that the chicken remains moist and tender during the cooking process. After marinating for a few hours or overnight, the chicken pieces are coated in a mixture of flour or breadcrumbs, which creates a crispy outer layer when deep-fried. The result is a delightful combination of textures and flavors. Chicken fry can be prepared in various regional styles and may incorporate unique ingredients and spices, depending on the culinary traditions of the area. Some variations may include the use of buttermilk or egg wash in the coating, adding a different dimension to the dish. Chicken fry is often served as an appetizer, snack, or even a main course, accompanied by various accompaniments such as chutneys, raita, or a cooling yogurt-based dip. Its versatility and irresistible taste make it a favorite in many parts of the world, and it is frequently enjoyed in homes, restaurants, and street food stalls. Whether you savor the spicy, bold flavors of Indian or Southern-style chicken fry, or you prefer a milder, classic rendition, this dish is sure to tantalize your taste buds with its crispy exterior and juicy, well-seasoned chicken inside.",
      "order": 13,
      "quantity":5
    },
    {
      "foodName": "vegetable Pizza",
      "foodImage": "https://i.ibb.co/Kj5nyv7/f6.png",
      "foodCategory": "Pizza",
      "price": 12.99,
      "description": "Spicy buffalo vegetable pizza with blue cheese dressing.",
      "details": "A vegetable pizza is a delectable and colorful creation that offers a delicious alternative to the classic meat-topped varieties. This pizza typically features a flavorful and often herb-infused tomato sauce spread over a pizza dough base, which serves as the canvas for a bountiful array of fresh and vibrant vegetables. The vegetables used in a vegetable pizza can vary widely, but they often include bell peppers, tomatoes, red onions, mushrooms, spinach, and black olives. These toppings not only provide a burst of color but also offer a delightful medley of flavors and textures. Cheese is a crucial component of any pizza, and vegetable pizzas are no exception. Mozzarella cheese is commonly used due to its excellent meltability and mild, creamy taste. The cheese is generously sprinkled over the sauce and vegetables, binding the ingredients together as it becomes gooey and golden brown in the oven. The pizza dough, often hand-stretched and thin in a traditional Italian style, forms the crisp and sturdy foundation for the toppings. The combination of the crust's subtle crunch, the savory tomato sauce, the vibrant vegetables, and the melted cheese creates a harmonious flavor profile that appeals to veggie lovers and pizza enthusiasts alike. Vegetable pizzas are popular choices for vegetarians and health-conscious individuals, as they offer a lighter and more nutritious option compared to meat-laden pizzas. This pizza variety is not only a feast for the taste buds but also a feast for the eyes, with its vivid colors and fresh, wholesome ingredients. Whether enjoyed at a pizzeria, made at home, or ordered for delivery, a vegetable pizza is a delightful and satisfying way to savor the natural goodness of vegetables on a slice of warm, cheesy perfection.",
      "order": 14,
      "quantity":11
    },
    {
      
      "foodName": "vegetable Burger",
      "foodImage": "https://i.ibb.co/K7C1Syn/f8.png",
      "foodCategory": "Burger",
      "price": 7.99,
      "description": "Juicy turkey burger with cranberry sauce and brie cheese.",
      "details": "A vegetable burger, also known as a veggie burger, is a plant-based alternative to the traditional beef burger. It has gained popularity among vegetarians, vegans, and those seeking a healthier, more environmentally friendly option. A vegetable burger typically consists of a patty made from a variety of plant-based ingredients, such as vegetables, legumes, grains, and sometimes soy-based proteins like tofu or tempeh. The patty is crafted to mimic the texture and flavor of a meat burger, providing a satisfying and hearty meal for those who choose to avoid animal products. Common ingredients used in vegetable burger patties include black beans, chickpeas, lentils, quinoa, mushrooms, sweet potatoes, and various spices to enhance the taste. The choice of bun for a vegetable burger is often similar to that of a traditional burger, including options like whole wheat, brioche, or even gluten-free buns. These buns are typically toasted to add a pleasant contrast in texture. Toppings for vegetable burgers are versatile and allow for personalization. Popular choices include fresh lettuce, ripe tomato slices, onions, pickles, and condiments like ketchup, mustard, and mayonnaise. Additionally, avocado, vegan cheese, sautéed mushrooms, and a range of plant-based sauces can be used to elevate the flavor profile of the burger. Vegetable burgers are not only enjoyed by those following plant-based diets but also by people looking to reduce their meat consumption. They provide a satisfying and nutritious alternative while contributing to environmental sustainability. Whether served at vegetarian restaurants, fast-food chains, or homemade with creative twists, vegetable burgers have become a delicious and inclusive option in the world of culinary innovation.",
      "order": 15,
      "quantity":13
    },
    {
      
      "foodName": "Chocolate Mousse",
      "foodImage": "https://i.ibb.co/wR60prp/404c075611063cc55e71f88a5e453a9c.jpg",
      "foodCategory": "Dessert",
      "price": 5.99,
      "description": "Decadent choclate with layers of coffee-soaked ladyfingers and mascarpone cream.",
      "details": "",
      "order": 19
    },
    {
      
      "foodName": "Fish Fries 3",
      "foodImage": "https://i.ibb.co/ygZPZgL/320-Krispy-Southern-Fish-Fry-Getty-986886194.jpg",
      "foodCategory": "Chips/Fries",
      "price": 4.99,
      "description": "Savor the sea's bounty with our crispy fish fry: golden, tender fillets, a hint of spice, and a dash of perfection.",
      "details": "View Details",
      "order": 12
    },
    {
      
      "foodName": "spicy Pizza",
      "foodImage": "https://i.ibb.co/2hp8gjt/f1.png",
      "foodCategory": "Pizza",
      "price": 14.89,
      "description": "Exotic seafood pizza with shrimp, crab, and a garlic herb drizzle.",
      "details": "View Details",
      "order": 14
    },
    {
      
      "foodName": "Chess Burger",
      "foodImage": "https://i.ibb.co/7ntZmnD/cheese-burger.png",
      "foodCategory": "Burger",
      "price": 8.99,
      "description": "Smokey BBQ bacon cheeseburger with crispy onion rings.",
      "details": "View Details",
      "order": 18
    },
    {
      
      "foodName": "Cakes",
      "foodImage": "https://i.ibb.co/BP54Lvh/toffes-cake.png",
      "foodCategory": "Dessert",
      "price": 6.99,
      "description": "Indulge in our delectable cakes: moist, flavorful, and pure delight in every bite. Perfect sweetness!",
      "details": "View Details",
      "order": 19
    },
    {
      
      "foodName": "Steak BBQ",
      "foodImage": "https://i.ibb.co/MBsChrc/steak.png",
      "foodCategory": "Chips/Fries",
      "price": 5.99,
      "description": "Savor the finest steak: juicy, tender, expertly seared, a culinary masterpiece for true connoisseurs",
      "details": "View Details",
      "order": 6
    },
    {
      
      "foodName": "Pizza",
      "foodImage": "https://i.ibb.co/xffxNL6/pizza.png",
      "foodCategory": "Pizza",
      "price": 14.99,
      "description": "Mediterranean pizza with kalamata olives, feta cheese, and a tzatziki drizzle.",
      "details": "View Details",
      "order": 11
    },
    {
      
      "foodName": "Special Burger",
      "foodImage": "https://i.ibb.co/xqHFVk4/f7.png",
      "foodCategory": "Burger",
      "price": 9.99,
      "description": "Veggie burger with a black bean patty, avocado, and chipotle mayo.",
      "details": "View Details",
      "order": 5
    },
    {
      
      "foodName": "Custard Pudding",
      "foodImage": "https://i.ibb.co/xqHFVk4/f7.png",
      "foodCategory": "Dessert",
      "price": 7.99,
      "description": "Creamy banana split with three scoops of ice cream, whipped cream, and cherries.",
      "details": "View Details",
      "order": 9
    },
    {
      
      "foodName": "Beaf steak ",
      "foodImage": "https://i.ibb.co/fSJXdtV/menu-4.jpg",
      "foodCategory": "Chips/Fries",
      "price": 6.99,
      "description": "Spicy jalapeno cheese fries served with a ool ranch dip.",
      "details": "View Details",
      "order": 12
    },
    {
      
      "foodName": "chess Pizza ",
      "foodImage": "https://i.ibb.co/4F6kbg2/menu-7.jpg",
      "foodCategory": "Pizza",
      "price": 15.99,
      "description": "Hawaiian pizza with pineapple, ham, and a sweet tomato sauce.",
      "details": "View Details",
      "order": 23
    }
  ]
  